#+title: Elisp Note
#+hugo_base_dir: /home/awannaphasch2016/org/projects/sideprojects/website/my-website/hugo/quickstart
#+filetags: elisp

*** what is #?
read [[https://stackoverflow.com/questions/4873810/what-does-mean-in-lisp][here]].
example
#+BEGIN_SRC emacs-lisp
(let ((foo 42))
  (flet ((foo () 'bar))
    (list foo (function foo) #'foo (foo))))
#+END_SRC

#+RESULTS:
| 42 | foo | foo | bar |

** advices
#+BEGIN_QUOTE
The “advice” feature lets you add to the existing definition of a
function, by “advising the function”.  This is a cleaner method than
redefining the whole function.
#+END_QUOTE

#+name: 4066926762
#+BEGIN_SRC emacs-lisp
(defun my-double (x)
  (* x 2))
(defun my-increase (x)
  (+ x 1))
(advice-add 'my-double :filter-return #'my-increase) :w

(my-double 3)
#+END_SRC

#+RESULTS:
: 7

Code ref:4066926762 returns 7 because advice "add function to the existing definition" of ~my-double~.

